png = '.png'
gif = '.gif'

a = [
    'В данном дополнительном этапе мы рассмотрим все возможные технологии, которые связаны с защитой базы, или атакой монстров. Но чтобы начать исследовать технологии нам нужно сделать производство Военных Исследовательских пакетов (чёрных пакетов). Для того, чтобы сделать их производство нам нужнен магазин с бронебойными патронами, граната и 2 стены.\n1) Производство магазинов с бронебойными патронами:',
    1,
    '2) Производство гранат:',
    2,
    '3) Производство стен:',
    3,
    '4) Производство чёрных пакетов:',
    4,
    'Если у вас нет сборочных автоматов 3 или скоростных конвейеров не волнуйтесь, поставьте то, что у вас максимально открыто на данный момент.\nТеперь пришло время исследовать. Если у вас не открыт нужный вам пакет технологий не беда, вы можете вернуться к этому этапу позже.\n1) Огнемёт. Открывает Огнемёт, Патроны для огнемёта и Огнемётную турель. Огнемёт это ещё один тип оружия доступный нам в игре и для его использования нужны Патроны для огнемёта, которые являются рецептом в химической лаборатории. Но кроме оружия вам открывается Огнемётная турель, которая наносит много урона по площади и для неё так же нужны Патроны для огнемёта.\n2) Мины. Открывает Мину, являются ловушками размещаемыми на земле и взрывающиеся при попадании врагов. Так же они после взрыва могут быть восстановлены дронами.\n3) Переработанное гарючее. Увеличивают урон огнём и урон огнемётных турелей.\n4) Дрон защитник. Открывает Капсулу с дронами защитниками и увеличивает максимальное количество следующих за персонажей дронов на 4. Можно сказать, это как граната, ты метаешь его рядом с тобой и он будет защищать тебя 45 секунд.\n5) Ракетостроение. Открывает Ракетницу и Ракету. Ракетница это ещё один вид оружия, который использует как боеприпасы ракеты. Сильное оружие для уничтожения ульев моснтров.\n6) Портативный генератор энергетического щита. Открывает Энергетический щит, который вставляется в ячейки брони и создаёт щит на 50 единиц здоровья.\n7) Военная промышленность 3. Открывает Кислотную гранату, Замедляющую капсулу и Боевой дробовик. Кислотная граната создаёт кислотное облако, которое наносит урон ядом.',
    5,
    '8) Разрывная ракета. Открывает Разрывную ракету. Являются заменой обычным ракетам, ведь у них увеличенный радиус поражения и урон.\n9) Усиленная взрывчатка. Увеличивает урон от гранат и мин. Так же некоторые исследования увеличивают урон от ракет.\n10) Количество следующих за персонажем дронов. Увеличивает максимальное количество за персонажем дронов.\n11) Персональная лазерная защита. Открывает Персональную лазерную защиту, которая вставляется в броню и стреляет в ближайших врагов.\n12) Электроразрядная защита. Открывает Электроразрядную защиту и Пульт электроразрядной защиты. Электроразрядная защита вставляется в броню, наносит урон, отбрасывает и оглушает врагов при активации Пультом элетроразрядной защиты.\n13) Лазерная турель. Открывает Лазерную турель. Если у вас на базе всё ещё стоят обычные турели и вам лень расставлять их вокруг стен, так как надо делать поставку патронов, то Лазерные турели для вас. У них больше урон, больше радиус поражения и им нужен только доступ к энергии.\n14) Дрон-приманка. Открывает Капсулу с дронами приманками, которые кидаются как гранаты и остаются на том месте на котором появились для отвлечения на себя врагов. Живут они 45 секунд.\n15) Портативный генератор электрического щита МК2. Открывает Энергетический щит МК2, который является заменой обычному энергетическому щиту, ведь он создаёт щит на 100 единиц здоровья больше.\n16) Танк. Открывает Танк, Крупнокалиберные снаряды и Разрывные крпунокалиберные снаряды. Танк, это ещё один вид транспорта в игре. Он куда бронированнее обычного багги и ещё может стрелять 3 видами оружия: танковое орудие, бортовой пулемёт, танковый огнемёт. Но он довольно медленный.\n17) Военная промышленность 4. Открывает Бронебойные патроны для дробовика и Кластерную гранату. Бронебойные патроны для дробовика являются заменой обычным патронам для дробовика. Кластерная граната является заменой обычной гранаты.\n18) Скорость стрельбы лазером. Увеличивает скорость стрельбы лазером.\n19) Портативный термоядерный генератор. Открывает Портативный термоядерный генератор. Один такой генератор это как 20 портативных солнечных панелей, но занимает очень много места.\n20) Дрон-разрушитель. Открывает Капсулу с дронами-разрушителями. Они как граната метаются и следуют за игроком и помогает ему в бою в течение 120 секунд.\n21) Силовая броня МК2. Открывает Силовую броню МК2, которая является заменой обычной силовой брони, ведь у неё на 51 ячейку больше в сетке оборудования и она даёт на 10 больше слотов в инвентаре. \n22) Урон энергетического оружия. Увеличивает урон от лазеров, электричества и лучевым оружием.\n23) Огнестрельный урон. Увеличивает урон от пуль, пулемётных турелей и дроби. Некоторые из технологий увеличивают урон крукноколиберных снарядов.\n24) Скорость стрельбы оружием. Увеличивает скорость стрельбы пулями, дробью, крупнокалиберными снарядами и ракетами.\n25) Скорострельность оружия. Увеличивает скорость стрельбы пулями, дробью, крупноколиберным снарядами, ракетами.\n6) Урановые боеприпасы. Открывает Магазин с урановыми патронами, Урановый крупнокалиберный снаряд и Разрывной урановый крупнокалиберный снаряд. Всё это является заменой бронебойным патронам и обычным крупнокалиберным и разрывным снарядам. Это самое последнее улучшение этих типов патронов и снарядов, лучше уже не будет.\n27) Артиллерия. Открывает Артиллерийский вагон, Артиллерийское орудие, Артиллерийский снаряд и Пульт управления артиллерией. Артиллерия отлично помогает расчистить территорию от ульев монстров. Если вас уже они достали, то ставьте Артиллерию, создавайте снаряды и монстры будут уничтожены.\n28) Паукотрон. Открывает Паукотрон и Пульт управления паукотроном. Паукотрон — ещё один вид транспорта в Factorio. В чём его польза? Во-первых у него есть своя сетка индивидуальных предметов, то есть вы можете поставить туда экхоскелеты, чтобы он был быстрее и это круто. Во-вторых, он умеет ходить через строения, полностью игнорируя их. В-третьих, он может атаковать врагов используя ракетницы, как и танк. В-четвёртых, он может переходить через маленькие озёрца как-то так:',
    6,
    'Вывод: Паукотрон прекрасен, создавайте его и кайфуйте от его функционала.\n29) Атомная бомба. Открывает Атомную бомбу, которая является мощнейшим оружием в игре, вставляется в Артиллерию и та производит залп. Испытаем мы её в дополнительной главе “Урановые технологии”.',
    'b Урановые технологии',
    'На этом все технологии с чёрным пакетом мы обсудили, но оказалось, что не все, остались ещё 9 технологий, которые открываются в белом пакете, про который мы говорим в дополнительной главе “Высокие технологии”. Если вы уже запустили ракету, то добро пожаловать в последний этап, теперь точно. Если ещё не запустили, то продолжайте следовать основному гайду.',

]



# on_touch_up: root.go_to_picture('start', 'source/gif/0/0_start.jpg')

for i in range(len(a)):
    try:
        x = int(a[i])
        x = str(a[i]) + '.png'
        print("DefaultImage: \n\tsource: 'source/gif/2A/" + x + "'" + "\n\ton_touch_up: root.go_to_picture('black', 'source/gif/2A/" + x + "'" + ")")
    except:
        if a[i][0] == 'b':
          print("ArticleButton: \n\ttext: '" + a[i][1:] + "'\n\ton_release: \n\t\troot.manager.current = ''\n\t\troot.manager.transition.direction = 'left'\n\t\troot.add_screen('black')")
        else:
          print("DefaultLabel: \n\ttext: " + repr(str(a[i])))

"""ArticleButton:
                text: '[color=#FA8C1C]III[/color] Синее пиво'
                on_release:
                    root.manager.current = 'blue'
                    root.manager.transition.direction = 'left'
                    root.add_screen('green')"""




