png = '.png'
gif = '.gif'

a = ['Во втором этапе наша цель сделать производство химических исследовательских пакетов (голубых пакетов) и изучить все нужные нам технологии.\n1. Перед тем, как приступить к производству голубых пакетов, нам нужно увеличить количество энергии. Для этого увеличьте количество бойлеров и паровых двигателей.\n2. Для того, чтобы сделать голубой пакет нам нужна: 1 сера, 3 улучшенных электросхемы и 2 твердотопливных двигателя. Начнём с производства серы. Для её производства нам нужны попутный нефтяной газ и вода. В прошлом этапе мы изучитили Переработку нефти и показали как нефть выглядит на карте, теперь вам нужно поставить на каждую точку добывания сырой нефти нефтяную вышку. Нефть вы можете доставить на базу с помощью труб (используйте подземные трубы, так как они занимают мало места на поверхности). Но если у вас нефть слишком далеко от базы, то рекомендуем прочитать дополнительную главу “ Железные дороги ”.',
    'b Железные дороги',
    'Когда нефть будет доставлена на базу сделайте несколько резервуаров, чтобы хранить её запасы.\n3. Чтобы сделать попутный нефтяной газ, нам нужны нефтеперерабатывающие заводы, они как сборщики, но только с другими рецептами. Производство попутного нефтяного газа: ',
    1,
    '4. Производство серы: ',
     2,
     '5. Теперь приступим к производству Улучшенных электросхем. Для одной нам нужно 2 пластиковых бруска, 4 медных кабеля и 2 электросхемы. Медные кабели и электросхемы у нас имеются, остались пластиковые бруски. Производство их выглядит так: ',
     3,
     '6. Производство улучшенных электросхем: ',
     4,
     '7. Остались твердотопливные двигатели. Для одного нам нужна стальная балка, железная шестерня и 2 трубы. Нам не хватает только труб, сделаем их производство: ',
     5,
     '8. Производство двигателей:',
     6,
     '9. Теперь, когда у нас всё готово делаем производство голубых пакетов:',
     7,
     '10. Пора исследовать!',
     8,
     9,
     10,
     11,
     'Важные нам технологии: Продвинутая переработка нефти, Смазочная жидкость, Электродвигатель, Робототехника, Строительная робототехника, Персональная дронстанция, Скорость рабочего дрона 1, Скорость рабочего дрона 2, Электроснабжение 2, Продвинутая металлургия 2, Производственный исследовательский пакет, Грузоподъёмность рабочего дрона 1, Логистическая робототехника, Скорость лабораторий 3, Бонус вместимости манипулятора 3, Продвинутая электроника 2, Оборудования экзоскелета, Модуль скорости 2, Модуль продуктивности 2, Силовая броня, Конструкция малой плотности, Вспомогательный исследовательский пакет, Личный аккумулятор МК2, Скорость лаборатории 4, Продуктивность добычи 2. \nНе совсем важные: Модуль эффективности 2, Лазерные технологии, Сила торможения 1, Переработка урана, Ракетное топливо, Ядерная энергия.\nПока исследуется расскажем, что делает каждая технология.\n1) Продвинутая переработка нефти. Открывает Продвинутую переработку нефти рецепт в нефтеперерабатывающем заводе. Переработку мазута в дизельное топливо и Переработку дизельного топлива в попутный нефтяной газ, Твёрдое топливо рецепты в химическом заводе.\n2) Смазочная жидкость. Открывает Смазочную жидкость рецепт в химическом заводе.\n3) Электродвигатель. Открывает новый рецепт в сборщике - Электродвигатель.\n4) Робототехника. Открывает новый рецепт Каркас дрона.\n5) Строительная робототехника. Открывает Дронстанцию, Сундук пассивного снабжения, Сундук хранения и Строительного дрона. Дронастанция соединяется с другими дронстанциями для создания логистических сетей, используемых строительными и транспортными дронами. Соединяются они на расстоянии оранжевой области, если жёлтую линию будет пересекать зелёная область, то дронстанции не соединятся. ',
     12,
     'В каждом слоте может быть по 50 Дронов, так же им можно в нижний слот закинуть ремонтный комплект.',
     13,
     'Сундук пассивного снабжения представляет только своё содержимое логистической цепи. \nСундук хранения представляет общее хранилище логистической цепи. \nСтроительный дрон автоматически ставит и ремонтирует дружественный постройки, область строительства Строительных дронов находится и в оранжевой и зелёной области, дальше они не видят. Теперь давайте сделаем мини производство Строительных дронов. Для начала нам надо перестроить производство переработки нефти и сделать продвинутую переработку нефти, снесите, что у вас было, теперь нам надо сделать вот так, знаем, выглядит страшно: ',
     14,
     'И сделайте хранение попутного нефтяного газа, дизельного топлива и мазута. Зачем это надо. Если хоть одна из жидкостей переполнится, то производство остановится и другие жидкости перестанут производиться, поэтому нам важно хранить каждую из них, и если надо опустошать систему.',
     15,
     'На данный момент нам не нужно дизельное топливо, поэтому сделаем производство переработки дизельного топлива в попутный нефтяной газ, делается оно вот так:',
     16,
     'Теперь делаем производство смазочной жидкости и также храним её в резервуарах:',
     17,
     'Далее делаем производство серной кислоты:',
     18,
     'Производство аккумуляторов:',
     19,
     'Производство каркасов дронов:',
     20,
     'И наконец произодство строительных дронов:',
     21,
     'Если взять предмет и зажать shift, то он пометится призраком и станет элементом планирования. Призрак не тратится из инвентаря. Призраки работают как пометки для дронов, где надо что-то построить.',
     22,
     '6) Персональная дронстанция. Открывает Персональную дронстанцию, которая вставляется в броню и повзоляет строительным дронам работать из инвентаря. Очень хороший предмет для строительства отдельных участков.\n7) Скорость рабочего дрона 1. Скорость дронов +35%.\n8) Скорость рабочего дрона 2. Скорость дронов +40%.\n9) Электроснабжение 2. Открывает Подстанцию, у которой дальность провода на 9 больше чем у средней опоры ЛЭП и охватывает она площадь в 18 x 18. Пример разницы площадей:',
     23,
     'Теперь мы можем сделать производство солнечных панелей, аккумуляторов и подстанций, чтобы начать пользоваться солнечной энергией. Производство солнечных панелей:',
     24,
     'Производство аккумуляторов:',
     25,
     'Производство подстанций:',
     26,
     'Теперь, если у вас не будет хватать энергии улучшайте запасы солнечными панелями и аккумуляторами. Пример расстановки одного сектора:',
     27,
     'Чтобы каждый раз не строить его вручную, сделайте отдельный чертёж. Чтобы его сделать выберите в нижней панели рядом с панелью быстрого доступа кнопку чертёж. Так же тут есть план сноса, дроны будут сносить, что вы прикажете и план обновления, замены одних элементов на другие, но при этом они должны быть одного типажа.',
     28,
     'Когда выделите зону появится вот такое окно, где можно назвать чертёж, при нажатии “Создать чертёж” чертёж создастся. Чертёж должен быть у вас в инвентаре и вы можете добавить его в панель быстрого доступа.',
     29,
     'Ставьте чертёж на свободную местность и дроны будут сами всё за вас строить!\n10) Продвинутая металлургия 2. Открывает Электрическую печь. Пришло время избавиться от угольных печек и заменить всё на электрические, но нам для начала нужно сделать их производство:',
     30,
     'Теперь сносите, все ваши плавильни. Время перемен! Колонна электрических печек выглядит так:',
     31,
     'Так сделайте с железом, медью, стальными балками, и сами уже корректируйте, чтобы вам всего хватало, на вашем заводе.\nНа данном этапе у вас могла закончится какая либо жила с рудой, если у вас уже меньше 100к, то уже пора искать новую жилу и обустраивать её. Доставку до базы можете выбирать сами, можете конвейерами, или поездами, что конечно лучше.\nЕсли у вас не хватает энергии, застраивайте солнечными панелями, как было показано раньше.\n11) Производственный исследовательский пакет. Открывает Производственный исследовательский пакет (фиолетовый пакет), про которй будет говорится в 4 этапе.\n12) Грузоподъёмность рабочего дрона 1. Увеличивает количество предметов переносимыми дронами на 1.\n13) Логистическая робототехника. Открывает Дронстанцию, Сундук пассивного снабжения, Сундук хранения, Транспортный дрон, логический запросы персонажа и 30 мусорных логистических слотов. Из этого исследования нам важны Транспортные дроны, с помощью которых мы сможем быстро запрашивать предметы в наш инвентарь. Давайте сделаем их производство:',
     32,
     'Чтобы дрон принёс вам предмет, этот предмет должен быть в каком либо логистическом сундуке. В инвентаре у вас появилось новое окно “Логистика”, если нажать на пустую ячейку вам предложат выбрать предмет и минимальное кличество предметов которое у вас должно быть в инвентаре и максимальное. Если у вас не будет хватать предметов, то дроны принесут вам предмет, если будут излишки заберут и положат в логистические сундуки. Если положить предметы в мусорные слоты дроны заберут его и положат в логистические сундуки.',
     33,
     'Про Сундук пассивного снабжение говорится подробнее в дополнительной главе “Дроны”',
     'b Дроны',
     '14) Скорость лабораторий 3. Бонус к скорости исследования в лабораториях +40%.\n15) Бонус вместимости манипулятора 3. Бонус вместимости пакетного манипулятора +1.\n16) Продвинутая электроника 2. Открывает рецепт в сборщике - процессор.\n17) Оборудования экзоскелета. Открывает Экзоскелет, который увеличивает скорость передвижения на 30%.\n18) Модуль скорости 2. Открывает рецепт Модуль скорости 2.19) Модуль продуктивности 2. Открывает рецепт Модуль продуктивности 2.\n20) Силовая броня. Открывает Силовую броню, которая замена Модульной броне, ведь у неё лучше защита и размер сетки оборудования на 24 ячейки больше и даёт 20 бонусный слотов в инвентаре.\n21) Конструкция малой плотности. Открывает рецепт конструкцию малой плотности.\n22) Вспомогательный исследовательский пакет. Открывает Вспомогательный исследовательский пакет (жёлтый пакет), про который будет говорится в 5 этапе.\n23) Личный аккумулятор МК2. Открывает Личный аккумулятор МК2, которые замена личных аккумуляторов.\n24) Скорость лаборатории 4. Бонус к скорости исследования в лабораториях +50%.\n25) Продуктивность добычи 2. Продуктивность добычи +10%.',
     'Технологии по желанию.',
     '1) Модуль эффективности 2. Открывает рецепт Модуль эффективности 2.\n2) Лазерные технологии. Открывает новую ветку технологий. Если у вас уже начали спавниться Синего цвета монстры, то рекомендуем перейти к дополнительной главе “Чёрный пакет”, чтобы защитить свою базу с помощью лазерных турелей.',
     'b Чёрный пакет',
     '3) Сила торможения 1. Сила торможения поездов +10%.\n4) Про технологии Переработка урана и Ядерная энергия говорится подробнее в дополнительное главе “Урановые технологии”.',
     'b Урановые технологии',
     '5) Ракетное топливо. Открывает Ракетное топливо, которые позволяет машине, поездам, ездить быстрее.',
     'Новичок за работой!',
     'Поздравляем вы прошли третий этап. Теперь вы можете поставить игру на паузу и посмотреть на продвижение нашего Новичка. Давайте посмотрим что он сделал за несколько часов игры.',
     34,
     'База Новичка - панорама',
     'Ох, что же тут случилось. Мы провели анализ и оказалось, что Новичок переехал со своей прошлой базы поближе к новым рудам и освоился там, давайте посмотрим поближе, что у него там получилось.',
     35,
     36,
     37,
     'База Новичка - энергия',
     'Видим, что Новичок перешёл уже к солнечной энергии и оставил мини на пару на всякий случай. Хорошая энергия, разделил солнечные панели и аккумуляторы. В нашем чертеже всё вместе, но можно делать как у Новичка, тут уже дело вкуса.',
     38,
     'База Новичка – плавильня',
     'Хорошая плавильня, есть 2 колонны, одна медных пластин, вторая железных. Компактно, элегантно, всё как надо.',
     39,
     40,
     'База Новичка – производство пакетов.',
     'Новичок переделал производство пакетов, но есть один минус пакеты идут только по одной стороне конвейеров, лучше сделать, чтобы они занимали обе стороны конвейера, так будет продуктивнее.',
     41,
     42,
     43,
     'База Новичка – остальные производства.',
     'Здесь оставляем рассмотрение ошибок на вас. Теперь вы можете сами найти их.',
     'Половина пройдена!',
     'Вы прошли третий этап нашего гайда и прошли его половину игры, до победы ещё далеко, но главное не сдаваться и идти вперёд, и в скором вы запустите ракету. Главное планируйте и эксперементируйте. А теперь пора переходить к четвёртому этапу.',
]


# on_touch_up: root.go_to_picture('start', 'source/gif/0/0_start.jpg')

for i in range(len(a)):
    try:
        x = int(a[i])
        x = str(a[i]) + '.png'
        print("DefaultImage: \n\tsource: 'source/gif/3/" + x + "'" + "\n\ton_touch_up: root.go_to_picture('blue', 'source/gif/3/" + x + "'" + ")")
    except:
        if a[i][0] == 'b':
          print("ArticleButton: \n\ttext: '" + a[i][1:] + "'\n\ton_release: \n\t\troot.manager.current = ''\n\t\troot.manager.transition.direction = 'left'\n\t\troot.add_screen('')")
        else:
          print("DefaultLabel: \n\ttext: " + repr(str(a[i])))

"""ArticleButton:
                text: '[color=#FA8C1C]III[/color] Синее пиво'
                on_release:
                    root.manager.current = 'blue'
                    root.manager.transition.direction = 'left'
                    root.add_screen('green')"""




